ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/comp_e.xml
<module id="COMP_E" HW_revision=""><register id="CTL0" width="16" offset="0x0" internal="0" description="Comparator Control Register 0"><bitfield id="IPSEL" description="Channel input selected for the V+ terminal of the comparator if" begin="3" end="0" width="4" rwaccess="R/W"><bitenum id="IPSEL__0" value="0" description="Channel 0 selected"/><bitenum id="IPSEL__1" value="1" description="Channel 1 selected"/><bitenum id="IPSEL__2" value="2" description="Channel 2 selected"/><bitenum id="IPSEL__3" value="3" description="Channel 3 selected"/><bitenum id="IPSEL__4" value="4" description="Channel 4 selected"/><bitenum id="IPSEL__5" value="5" description="Channel 5 selected"/><bitenum id="IPSEL__6" value="6" description="Channel 6 selected"/><bitenum id="IPSEL__7" value="7" description="Channel 7 selected"/><bitenum id="IPSEL__8" value="8" description="Channel 8 selected"/><bitenum id="IPSEL__9" value="9" description="Channel 9 selected"/><bitenum id="IPSEL__16" value="10" description="Channel 10 selected"/><bitenum id="IPSEL__17" value="11" description="Channel 11 selected"/><bitenum id="IPSEL__18" value="12" description="Channel 12 selected"/><bitenum id="IPSEL__19" value="13" description="Channel 13 selected"/><bitenum id="IPSEL__20" value="14" description="Channel 14 selected"/><bitenum id="IPSEL__21" value="15" description="Channel 15 selected"/></bitfield><bitfield id="IPEN" description="Channel input enable for the V+ terminal of the comparator." begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="IPEN__0" value="0" description="Selected analog input channel for V+ terminal is disabled"/><bitenum id="IPEN__1" value="1" description="Selected analog input channel for V+ terminal is enabled"/></bitfield><bitfield id="IMSEL" description="Channel input selected for the - terminal of the comparator if " begin="11" end="8" width="4" rwaccess="R/W"><bitenum id="IMSEL__0" value="0" description="Channel 0 selected"/><bitenum id="IMSEL__1" value="1" description="Channel 1 selected"/><bitenum id="IMSEL__2" value="2" description="Channel 2 selected"/><bitenum id="IMSEL__3" value="3" description="Channel 3 selected"/><bitenum id="IMSEL__4" value="4" description="Channel 4 selected"/><bitenum id="IMSEL__5" value="5" description="Channel 5 selected"/><bitenum id="IMSEL__6" value="6" description="Channel 6 selected"/><bitenum id="IMSEL__7" value="7" description="Channel 7 selected"/><bitenum id="IMSEL__8" value="8" description="Channel 8 selected"/><bitenum id="IMSEL__9" value="9" description="Channel 9 selected"/><bitenum id="IMSEL__16" value="10" description="Channel 10 selected"/><bitenum id="IMSEL__17" value="11" description="Channel 11 selected"/><bitenum id="IMSEL__18" value="12" description="Channel 12 selected"/><bitenum id="IMSEL__19" value="13" description="Channel 13 selected"/><bitenum id="IMSEL__20" value="14" description="Channel 14 selected"/><bitenum id="IMSEL__21" value="15" description="Channel 15 selected"/></bitfield><bitfield id="IMEN" description="Channel input enable for the - terminal of the comparator." begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="IMEN__0" value="0" description="Selected analog input channel for V- terminal is disabled"/><bitenum id="IMEN__1" value="1" description="Selected analog input channel for V- terminal is enabled"/></bitfield></register><register id="CTL1" width="16" offset="0x2" internal="0" description="Comparator Control Register 1"><bitfield id="OUT" description="Output value" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="OUTPOL" description="Output polarity. This bit defines the CEOUT polarity." begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="OUTPOL__0" value="0" description="Noninverted"/><bitenum id="OUTPOL__1" value="1" description="Inverted"/></bitfield><bitfield id="F" description="Output filter. Available if CEPWRMD = 00, 01." begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="F__0" value="0" description="Comparator output is not filtered"/><bitenum id="F__1" value="1" description="Comparator output is filtered"/></bitfield><bitfield id="IES" description="Interrupt edge select for CEIIFG and CEIFG." begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="IES__0" value="0" description="Rising edge for CEIFG, falling edge for CEIIFG"/><bitenum id="IES__1" value="1" description="Falling edge for CEIFG, rising edge for CEIIFG"/></bitfield><bitfield id="SHORT" description="Input short. This bit shorts the + and – input terminals." begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="SHORT__0" value="0" description="Inputs not shorted"/><bitenum id="SHORT__1" value="1" description="Inputs shorted"/></bitfield><bitfield id="EX" description="Exchange" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="FDLY" description="Filter delay" begin="7" end="6" width="2" rwaccess="R/W"><bitenum id="FDLY__0" value="0" description="Typical filter delay of TBD (450) ns"/><bitenum id="FDLY__1" value="1" description="Typical filter delay of TBD (900) ns"/><bitenum id="FDLY__2" value="2" description="Typical filter delay of TBD (1800) ns"/><bitenum id="FDLY__3" value="3" description="Typical filter delay of TBD (3600) ns"/></bitfield><bitfield id="PWRMD" description="Power Mode" begin="9" end="8" width="2" rwaccess="R/W"><bitenum id="PWRMD__0" value="0" description="High-speed mode"/><bitenum id="PWRMD__1" value="1" description="Normal mode"/><bitenum id="PWRMD__2" value="2" description="Ultra-low power mode"/></bitfield><bitfield id="ON" description="On" begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="ON__0" value="0" description="Off"/><bitenum id="ON__1" value="1" description="On"/></bitfield><bitfield id="MRVL" description="This bit is valid of CEMRVS is set to 1." begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="MRVL__0" value="0" description="VREF0 is selected if CERS = 00, 01, or 10"/><bitenum id="MRVL__1" value="1" description="VREF1 is selected if CERS = 00, 01, or 10"/></bitfield><bitfield id="MRVS" description="This bit defines if the comparator output selects between VREF0" begin="12" end="12" width="1" rwaccess="R/W"><bitenum id="MRVS__0" value="0" description="Comparator output state selects between VREF0 or VREF1"/><bitenum id="MRVS__1" value="1" description="CEMRVL selects between VREF0 or VREF1"/></bitfield></register><register id="CTL2" width="16" offset="0x4" internal="0" description="Comparator Control Register 2"><bitfield id="REF0" description="Reference resistor tap 0" begin="4" end="0" width="5" rwaccess="R/W"/><bitfield id="RSEL" description="Reference select" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="RSEL__0" value="0" description="When CEEX = 0, VREF is applied to the V+ terminal; When CEEX = "/><bitenum id="RSEL__1" value="1" description="When CEEX = 0, VREF is applied to the V- terminal; When CEEX = "/></bitfield><bitfield id="RS" description="Reference source" begin="7" end="6" width="2" rwaccess="R/W"><bitenum id="RS__0" value="0" description="No current is drawn by the reference circuitry"/><bitenum id="RS__1" value="1" description="VCC applied to the resistor ladder"/><bitenum id="RS__2" value="2" description="Shared reference voltage applied to the resistor ladder"/><bitenum id="RS__3" value="3" description="Shared reference voltage supplied to V(CREF)"/></bitfield><bitfield id="REF1" description="Reference resistor tap 1" begin="12" end="8" width="5" rwaccess="R/W"/><bitfield id="REFL" description="Reference voltage level" begin="14" end="13" width="2" rwaccess="R/W"><bitenum id="REFL__0" value="0" description="Reference amplifier is disabled"/><bitenum id="REFL__1" value="1" description="1.2 V is selected as shared reference voltage input"/><bitenum id="REFL__2" value="2" description="2.0 V is selected as shared reference voltage input"/><bitenum id="REFL__3" value="3" description="2.5 V is selected as shared reference voltage input"/></bitfield><bitfield id="REFACC" description="Reference accuracy" begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="REFACC__0" value="0" description="Static mode"/><bitenum id="REFACC__1" value="1" description="Clocked (low power, low accuracy) mode"/></bitfield></register><register id="CTL3" width="16" offset="0x6" internal="0" description="Comparator Control Register 3"><bitfield id="PD0" description="Port disable" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="PD0__0" value="0" description="The input buffer is enabled"/><bitenum id="PD0__1" value="1" description="The input buffer is disabled"/></bitfield><bitfield id="PD1" description="Port disable" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="PD1__0" value="0" description="The input buffer is enabled"/><bitenum id="PD1__1" value="1" description="The input buffer is disabled"/></bitfield><bitfield id="PD2" description="Port disable" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="PD2__0" value="0" description="The input buffer is enabled"/><bitenum id="PD2__1" value="1" description="The input buffer is disabled"/></bitfield><bitfield id="PD3" description="Port disable" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="PD3__0" value="0" description="The input buffer is enabled"/><bitenum id="PD3__1" value="1" description="The input buffer is disabled"/></bitfield><bitfield id="PD4" description="Port disable" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="PD4__0" value="0" description="The input buffer is enabled"/><bitenum id="PD4__1" value="1" description="The input buffer is disabled"/></bitfield><bitfield id="PD5" description="Port disable" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="PD5__0" value="0" description="The input buffer is enabled"/><bitenum id="PD5__1" value="1" description="The input buffer is disabled"/></bitfield><bitfield id="PD6" description="Port disable" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="PD6__0" value="0" description="The input buffer is enabled"/><bitenum id="PD6__1" value="1" description="The input buffer is disabled"/></bitfield><bitfield id="PD7" description="Port disable" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="PD7__0" value="0" description="The input buffer is enabled"/><bitenum id="PD7__1" value="1" description="The input buffer is disabled"/></bitfield><bitfield id="PD8" description="Port disable" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="PD8__0" value="0" description="The input buffer is enabled"/><bitenum id="PD8__1" value="1" description="The input buffer is disabled"/></bitfield><bitfield id="PD9" description="Port disable" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="PD9__0" value="0" description="The input buffer is enabled"/><bitenum id="PD9__1" value="1" description="The input buffer is disabled"/></bitfield><bitfield id="PD10" description="Port disable" begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="PD10__0" value="0" description="The input buffer is enabled"/><bitenum id="PD10__1" value="1" description="The input buffer is disabled"/></bitfield><bitfield id="PD11" description="Port disable" begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="PD11__0" value="0" description="The input buffer is enabled"/><bitenum id="PD11__1" value="1" description="The input buffer is disabled"/></bitfield><bitfield id="PD12" description="Port disable" begin="12" end="12" width="1" rwaccess="R/W"><bitenum id="PD12__0" value="0" description="The input buffer is enabled"/><bitenum id="PD12__1" value="1" description="The input buffer is disabled"/></bitfield><bitfield id="PD13" description="Port disable" begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="PD13__0" value="0" description="The input buffer is enabled"/><bitenum id="PD13__1" value="1" description="The input buffer is disabled"/></bitfield><bitfield id="PD14" description="Port disable" begin="14" end="14" width="1" rwaccess="R/W"><bitenum id="PD14__0" value="0" description="The input buffer is enabled"/><bitenum id="PD14__1" value="1" description="The input buffer is disabled"/></bitfield><bitfield id="PD15" description="Port disable" begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="PD15__0" value="0" description="The input buffer is enabled"/><bitenum id="PD15__1" value="1" description="The input buffer is disabled"/></bitfield></register><register id="INT" width="16" offset="0xC" internal="0" description="Comparator Interrupt Control Register"><bitfield id="IFG" description="Comparator output interrupt flag" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="IFG__0" value="0" description="No interrupt pending"/><bitenum id="IFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IIFG" description="Comparator output inverted interrupt flag" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="IIFG__0" value="0" description="No interrupt pending"/><bitenum id="IIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="RDYIFG" description="Comparator ready interrupt flag" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="RDYIFG__0" value="0" description="No interrupt pending"/><bitenum id="RDYIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IE" description="Comparator output interrupt enable." begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="IE__0" value="0" description="Interrupt disabled"/><bitenum id="IE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="IIE" description="Comparator output interrupt enable inverted polarity." begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="IIE__0" value="0" description="Interrupt disabled"/><bitenum id="IIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="RDYIE" description="Comparator ready interrupt enable." begin="12" end="12" width="1" rwaccess="R/W"><bitenum id="RDYIE__0" value="0" description="Interrupt disabled"/><bitenum id="RDYIE__1" value="1" description="Interrupt enabled"/></bitfield></register><register id="IV" width="16" offset="0xE" internal="0" description="Comparator Interrupt Vector Word Register"><bitfield id="IV" description="Comparator interrupt vector word register" begin="15" end="0" width="16" rwaccess="R/W"><bitenum id="IV__0" value="0" description="No interrupt pending"/><bitenum id="IV__2" value="2" description="Interrupt Source: CEOUT interrupt; Interrupt Flag: CEIFG; Inter"/><bitenum id="IV__4" value="4" description="Interrupt Source: CEOUT interrupt inverted polarity; Interrupt "/><bitenum id="IV__16" value="10" description="Interrupt Source: Comparator ready interrupt; Interrupt Flag: C"/></bitfield></register></module>